### <b><u> PANDAS

In [1]:
import pandas as pd
import numpy as np

In [ ]:
p1=pd.Series([100,200,300],index=['a','b','c'])       # Creating a Pandas Series with custom index
p1

a    100
b    200
c    300
dtype: int64

In [4]:
p1.index=['l','m','n']
p1

l    100
m    200
n    300
dtype: int64

In [ ]:
p1[0]                     # Accessing element by position as index which has been changed

C:\Users\DELL\AppData\Local\Temp\ipykernel_26028\1178487653.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  p1[0]

np.int64(100)

In [7]:
p1['l']

np.int64(100)

In [ ]:
p1.sum()                    # Sum of all elements in the Series

np.int64(600)

In [ ]:
p1.min()                    # Minimum element in the Series

np.int64(100)

In [ ]:
p1.max()                    # Maximum element in the Series

np.int64(300)

In [ ]:
type(p1)                    # Checking the type of p1

pandas.core.series.Series

In [ ]:
df1=pd.DataFrame({'Name':['Aaditya','Muskan','Chirag','Vaibhav'],'Marks':[92,98,90,84],'Subjects':['Maths','Physics','Chemistry','Biology']})                             # Creating a Pandas DataFrame
df1

      Name  Marks
0  Aaditya     92
1   Muskan     98
2   Chirag     90
3  Vaibhav     84

In [16]:
type(df1)

pandas.core.frame.DataFrame

In [ ]:
df1.index                        # Checking the index of the DataFrame

RangeIndex(start=0, stop=4, step=1)

In [ ]:
df1.columns                      # Checking the columns of the DataFrame

Index(['Name', 'Marks'], dtype='object')

In [ ]:
df1['Marks']                     # Accessing a column in the DataFrame

0    92
1    98
2    90
3    84
Name: Marks, dtype: int64

In [ ]:
type(df1['Marks'])               # Checking the type of the accessed column

pandas.core.series.Series

In [22]:
df1['Name']=['A','M','C','V']   # Modifying a column in the DataFrame
df1

  Name  Marks
0    A     92
1    M     98
2    C     90
3    V     84

In [29]:
df1.iloc[0:2,0:2]                   # iloc( row start index: row stop index , column start index: column stop index, step:step) Accessing rows by integer-location based indexing

  Name  Marks
0    A     92
1    M     98